app/controllers/movies_controller.rb

INSERT INTO "movies" ("name_movie", "url_picture", "day_present", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name_movie", "Avengers"], ["url_picture", "Https:asldhjfaskdf.fasdfsa"], ["day_present", "2019-08-15"], ["created_at", "2019-08-18 03:18:51.421610"], ["updated_at", "2019-08-18 03:18:51.421610"]]
---
    def create
      @board = @movie.boards.build
      @board.safe_attributes = params[:board]
      if @board.save