app/controllers/welcome_controller.rb

SELECT "movies".* FROM "movies"
---
  def index
    @movie = News.latest Movie.current